# Есть список numbers = [0, 99, 100, 53, 44, 23, 4, 8, 16, 15, 77, 51]
# Вывести все нечетные числа больше 50, используя функцию filter().
def f(x):
    return 1 if (x > 50 and x % 2 != 0) else 0

numbers = [0, 99, 100, 53, 44, 23, 4, 8, 16, 15, 77, 51]
print(list(filter(f, numbers)))